-- ----------------------------
-- 2、部门表
-- ----------------------------
DROP TABLE IF EXISTS mdm_department;

CREATE TABLE mdm_department
(
    id                BIGINT AUTO_INCREMENT PRIMARY KEY COMMENT '部门ID',
    -- 生成列，使用 STORED 使其支持索引和唯一约束
    department_code   VARCHAR(8) GENERATED ALWAYS AS (
        CONCAT(organization_code, IFNULL(unit_code, ''), IFNULL(sub_unit_code, ''))
        ) STORED UNIQUE COMMENT '部门编码（自动生成）',
    organization_name VARCHAR(255) NOT NULL COMMENT '组织名称',
    organization_code VARCHAR(4)   NOT NULL COMMENT '组织编码',
    unit_name         VARCHAR(255) DEFAULT NULL COMMENT '一级单位名称',
    unit_code         VARCHAR(2)   DEFAULT NULL COMMENT '一级编码',
    sub_unit_name     VARCHAR(255) DEFAULT NULL COMMENT '二级单位名称',
    sub_unit_code     VARCHAR(2)   DEFAULT NULL COMMENT '二级编码',
    create_by         VARCHAR(64)  DEFAULT 'admin' COMMENT '创建者',
    create_time       DATETIME     DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
    update_by         VARCHAR(64)  DEFAULT NULL COMMENT '更新者',
    update_time       DATETIME     DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
    remark            VARCHAR(500) DEFAULT NULL COMMENT '备注'

) COMMENT ='部门表';

-- ----------------------------
-- 部门表初始化数据
-- ----------------------------
INSERT INTO mdm_department
(organization_name, organization_code, unit_name, unit_code, sub_unit_name, sub_unit_code)
VALUES ('广东精艺金属股份有限公司', '8001', NULL, NULL, NULL, NULL),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', NULL, NULL),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '总经理室', '01'),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '监事会', '02'),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '董事办', '03'),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '财务部', '04'),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '审计法务部', '05'),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '人力运营部', '06'),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '科技行政部', '07'),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '资产管理部', '08'),
       ('广东精艺金属股份有限公司', '8001', '股份本部', '01', '挂靠', '09'),
       ('广东精艺金属股份有限公司', '8001', '顺德工厂', '02', NULL, NULL),
       ('广东精艺金属股份有限公司', '8001', '顺德工厂', '02', '总经理室', '01'),
       ('广东精艺金属股份有限公司', '8001', '顺德工厂', '02', '销售部', '02'),

       ('广东精艺销售有限公司', '8002', NULL, NULL, NULL, NULL),
       ('广东精艺销售有限公司', '8002', '股份本部', '01', NULL, NULL),
       ('广东精艺销售有限公司', '8002', '股份本部', '01', '财务部', '01'),
       ('广东精艺销售有限公司', '8002', '马龙产业事业部', '02', NULL, NULL),
       ('广东精艺销售有限公司', '8002', '马龙产业事业部', '02', '总经理室', '01'),
       ('广东精艺销售有限公司', '8002', '马龙产业事业部', '02', '财务部', '02'),
       ('广东精艺销售有限公司', '8002', '马龙产业事业部', '02', '采购部', '03'),
       ('广东精艺销售有限公司', '8002', '马龙产业事业部', '02', '营销部', '04'),
       ('广东精艺销售有限公司', '8002', '顺德工厂', '03', NULL, NULL),
       ('广东精艺销售有限公司', '8002', '顺德工厂', '03', '财务部', '01'),
       ('广东精艺销售有限公司', '8002', '顺德工厂', '03', '销售部', '02'),
       ('广东精艺销售有限公司', '8002', '顺德工厂', '03', '挂靠', '03'),

       ('广东精易晟新材料科技有限公司', '8003', NULL, NULL, NULL, NULL),
       ('广东精易晟新材料科技有限公司', '8003', '马龙产业事业部', '01', NULL, NULL),
       ('广东精易晟新材料科技有限公司', '8003', '马龙产业事业部', '01', '生产部', '01'),

       ('广东精艺万希能源科技有限公司', '8004', NULL, NULL, NULL, NULL),
       ('广东精艺万希能源科技有限公司', '8004', '股份本部', '01', NULL, NULL),
       ('广东精艺万希能源科技有限公司', '8004', '股份本部', '01', '科技行政部', '01'),
       ('广东精艺万希能源科技有限公司', '8004', '股份本部', '01', '资产管理部', '02'),
       ('广东精艺万希能源科技有限公司', '8004', '万希能源', '02', NULL, NULL),
       ('广东精艺万希能源科技有限公司', '8004', '万希能源', '02', '华南区新能源项目部', '01'),

       ('精艺（上海）科技有限公司', '8005', NULL, NULL, NULL, NULL),
       ('精艺（上海）科技有限公司', '8005', '股份本部', '01', NULL, NULL),
       ('精艺（上海）科技有限公司', '8005', '股份本部', '01', '财务部', '01'),

       ('上海精艺万希售电有限公司', '8006', NULL, NULL, NULL, NULL),
       ('上海精艺万希售电有限公司', '8006', '上海售电', '01', NULL, NULL),
       ('上海精艺万希售电有限公司', '8006', '上海售电', '01', '财务部', '01'),
       ('上海精艺万希售电有限公司', '8006', '上海售电', '01', '研发部', '02'),
       ('上海精艺万希售电有限公司', '8006', '上海售电', '01', '项目发展部', '03'),

       ('上海精艺万希新能源科技有限公司', '8007', NULL, NULL, NULL, NULL),
       ('上海精艺万希新能源科技有限公司', '8007', '上海精艺万希新能源', '01', NULL, NULL),
       ('上海精艺万希新能源科技有限公司', '8007', '上海精艺万希新能源', '01', '总经理室', '01'),
       ('上海精艺万希新能源科技有限公司', '8007', '上海精艺万希新能源', '01', '综合部', '02'),
       ('上海精艺万希新能源科技有限公司', '8007', '上海精艺万希新能源', '01', '技术部', '03'),

       ('芜湖精艺铜业有限公司', '8008', NULL, NULL, NULL, NULL),
       ('芜湖精艺铜业有限公司', '8008', '股份本部', '01', NULL, NULL),
       ('芜湖精艺铜业有限公司', '8008', '股份本部', '01', '资产管理部', '01'),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', NULL, NULL),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', '资产管理部', '01'),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', '芜湖销售部', '02'),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', '采购组', '03'),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', '人力运营部', '04'),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', '财务管理部', '05'),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', '设备管理部', '06'),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', '生产管理部', '07'),
       ('芜湖精艺铜业有限公司', '8008', '芜湖工厂', '02', '质量管理部', '08'),

       ('芜湖万希金属制品有限公司', '8009', NULL, NULL, NULL, NULL),
       ('芜湖万希金属制品有限公司', '8009', '芜湖工厂', '01', NULL, NULL),
       ('芜湖万希金属制品有限公司', '8009', '芜湖工厂', '01', '生产管理部', '01'),

       ('芜湖精艺新材料科技有限公司', '8010', NULL, NULL, NULL, NULL),
       ('芜湖精艺新材料科技有限公司', '8010', '芜湖工厂', '01', NULL, NULL),
       ('芜湖精艺新材料科技有限公司', '8010', '芜湖工厂', '01', '总经理室', '01'),
       ('芜湖精艺新材料科技有限公司', '8010', '芜湖工厂', '01', '人力运营部', '02'),
       ('芜湖精艺新材料科技有限公司', '8010', '芜湖工厂', '01', '财务管理部', '03'),
       ('芜湖精艺新材料科技有限公司', '8010', '芜湖工厂', '01', '设备管理部', '04'),
       ('芜湖精艺新材料科技有限公司', '8010', '芜湖工厂', '01', '质量管理部', '05'),

       ('佛山市顺德区精艺万希铜业有限公司', '8011', NULL, NULL, NULL, NULL),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '股份本部', '01', NULL, NULL),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '股份本部', '01', '财务部', '01'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '股份本部', '01', '资产管理部', '02'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '马龙产业事业部', '02', NULL, NULL),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '马龙产业事业部', '02', '采购部', '01'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '马龙产业事业部', '02', '生产部', '02'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '顺德工厂', '03', NULL, NULL),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '顺德工厂', '03', '总经理室', '01'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '顺德工厂', '03', '财务部', '02'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '顺德工厂', '03', '综合办', '03'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '顺德工厂', '03', '销售部', '04'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '顺德工厂', '03', '生产部', '05'),
       ('佛山市顺德区精艺万希铜业有限公司', '8011', '顺德工厂', '03', '挂靠', '06'),

       ('广东精晟信息科技有限公司', '8012', NULL, NULL, NULL, NULL),
       ('广东精晟信息科技有限公司', '8012', '股份本部', '01', NULL, NULL),
       ('广东精晟信息科技有限公司', '8012', '股份本部', '01', '资产管理部', '01'),

       ('佛山市北远企业服务有限公司', '8013', NULL, NULL, NULL, NULL),
       ('佛山市北远企业服务有限公司', '8013', '北远', '01', NULL, NULL),
       ('佛山市北远企业服务有限公司', '8013', '北远', '01', '生产部', '01'),

       ('广东国卫保安服务有限公司', '8014', NULL, NULL, NULL, NULL),
       ('广东国卫保安服务有限公司', '8014', '国卫', '01', NULL, NULL),
       ('广东国卫保安服务有限公司', '8014', '国卫', '01', '综合办', '01'),

       ('飞鸿国际发展有限公司', '8015', NULL, NULL, NULL, NULL),
       ('飞鸿国际发展有限公司', '8015', '股份本部', '01', NULL, NULL),
       ('飞鸿国际发展有限公司', '8015', '股份本部', '01', '飞鸿国际', '01'),

       ('佛山市能鸿科技（佛山市顺德区）有限公司', '8016', NULL, NULL, NULL, NULL),
       ('佛山市能鸿科技（佛山市顺德区）有限公司', '8016', '顺德工厂', '01', NULL, NULL),
       ('佛山市能鸿科技（佛山市顺德区）有限公司', '8016', '顺德工厂', '01', '生产部', '01');
